In [2]:
import pandas as pd
import numpy as np

 # read_csv()로 csv파일을 데이터프레임으로 로딩합니다.

In [4]:
titanic_df = pd.read_csv("C:/Users/wkdgu/권철민 머신러닝/PerfectGuide-master/PerfectGuide-master/2장/titanic/train.csv")
print('titanic 변수 type:',type(titanic_df))

titanic 변수 type: <class 'pandas.core.frame.DataFrame'>

 # head()와 tail()

In [3]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
titanic_df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

 # 데이터프레임 표시 옵션

 ## print()

In [5]:
print(titanic_df)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

 ## display()

In [6]:
display(titanic_df)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [7]:
display(titanic_df.head(3))
display(titanic_df.tail(3))

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

 ## pd.set_option()

In [8]:
pd.set_option('display.max_rows', 10)  # 표시되는 행 개수
pd.set_option('display.max_colwidth', 10)  # 컬럼 너비
pd.set_option('display.max_columns', 10)  # 표시되는 컬럼 개수
pd.set_option('display.width', 1000)   # 표시되는 전체 크기의 너비

titanic_df

     PassengerId  Survived  Pclass       Name     Sex  ...  Parch     Ticket     Fare Cabin  Embarked
0            1           0       3  Braund...    male  ...      0  A/5 21171   7.2500   NaN         S
1            2           1       1  Cuming...  female  ...      0   PC 17599  71.2833   C85         C
2            3           1       3  Heikki...  female  ...      0  STON/O...   7.9250   NaN         S
3            4           1       1  Futrel...  female  ...      0     113803  53.1000  C123         S
4            5           0       3  Allen,...    male  ...      0     373450   8.0500   NaN         S
..         ...         ...     ...        ...     ...  ...    ...        ...      ...   ...       ...
886        887           0       2  Montvi...    male  ...      0     211536  13.0000   NaN         S
887        888           1       1  Graham...  female  ...      0     112053  30.0000   B42         S
888        889           0       3  Johnst...  female  ...      2  W./C. ...  23.4500   NaN         S
889        890           1       1  Behr, ...    male  ...      0     111369  30.0000  C148         C
890        891           0       3  Dooley...    male  ...      0     370376   7.7500   NaN         Q

[891 rows x 12 columns]

 # 데이터프레임의 생성

In [9]:
dic1 = {'Name': ['Chulmin', 'Eunkyung','Jinwoong','Soobeom'],
        'Year': [2011, 2016, 2015, 2015],
        'Gender': ['Male', 'Female', 'Male', 'Male']
       }
# 딕셔너리를 DataFrame으로 변환
data_df = pd.DataFrame(dic1)
display(data_df)
print("#"*30)

# 새로운 컬럼명을 추가
data_df = pd.DataFrame(dic1, columns=["Name", "Year", "Gender", "Age"])
display(data_df)
print("#"*30)

# 인덱스를 새로운 값으로 할당. 
data_df = pd.DataFrame(dic1, index=['one','two','three','four'])
display(data_df)
print("#"*30)

       Name  Year  Gender
0   Chulmin  2011    Male
1  Eunkyung  2016  Female
2  Jinwoong  2015    Male
3   Soobeom  2015    Male

##############################

       Name  Year  Gender  Age
0   Chulmin  2011    Male  NaN
1  Eunkyung  2016  Female  NaN
2  Jinwoong  2015    Male  NaN
3   Soobeom  2015    Male  NaN

##############################

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

##############################

 # DataFrame의 컬럼명과 인덱스

In [10]:
print("columns:",titanic_df.columns)
print("index:",titanic_df.index)
print("index value:", titanic_df.index.values)

columns: Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'], dtype='object')
index: RangeIndex(start=0, stop=891, step=1)
index value: [  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

# 데이터프레임 필터링 및 시리즈 추출

In [11]:
# DataFrame객체에서 []연산자내에 한개의 컬럼만 입력하면 Series 객체를 반환  
series = titanic_df['Name']
print(series.head(3))
print("## type:",type(series))

# DataFrame객체에서 []연산자내에 여러개의 컬럼을 리스트로 입력하면 그 컬럼들로 구성된 DataFrame 반환  
filtered_df = titanic_df[['Name', 'Age']]
print(filtered_df.head(3))
print("## type:", type(filtered_df))

# DataFrame객체에서 []연산자내에 한개의 컬럼을 리스트로 입력하면 한개의 컬럼으로 구성된 DataFrame 반환 
one_col_df = titanic_df[['Name']]
print(one_col_df.head(3))
print("## type:", type(one_col_df))

0    Braund...
1    Cuming...
2    Heikki...
Name: Name, dtype: object
## type: <class 'pandas.core.series.Series'>
        Name   Age
0  Braund...  22.0
1  Cuming...  38.0
2  Heikki...  26.0
## type: <class 'pandas.core.frame.DataFrame'>
        Name
0  Braund...
1  Cuming...
2  Heikki...
## type: <class 'pandas.core.frame.DataFrame'>

 # shape()는 데이터프레임의 행, 열의 크기를 알려줍니다.

In [12]:
print('DataFrame 크기: ', titanic_df.shape)

DataFrame 크기:  (891, 12)

 # info()는 데이터프레임의 정보를 제공합니다

In [13]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

 # describe()는 숫자형 컬럼들에 대해서 통계정보를 제공합니다.

In [14]:
titanic_df.describe()

       PassengerId   Survived     Pclass        Age      SibSp      Parch       Fare
count  891.00...    891.00...  891.00...  714.00...  891.00...  891.00...  891.00...
mean   446.00...     0.383838   2.308642  29.699118   0.523008   0.381594  32.204208
std    257.35...     0.486592   0.836071  14.526497   1.102743   0.806057  49.693429
min     1.000000     0.000000   1.000000   0.420000   0.000000   0.000000   0.000000
25%    223.50...     0.000000   2.000000  20.125000   0.000000   0.000000   7.910400
50%    446.00...     0.000000   3.000000  28.000000   0.000000   0.000000  14.454200
75%    668.50...     1.000000   3.000000  38.000000   1.000000   0.000000  31.000000
max    891.00...     1.000000   3.000000  80.000000   8.000000   6.000000  512.32...

 # value_counts()로 개별 데이터값의 분포도를 제공합니다.

**동일한 개별 데이터 값이 몇건이 있는지 정보를 제공합니다. 
즉 개별 데이터값의 분포도를 제공합니다. 과거에는 Series객체에서만 호출될 수 
있었지만 현재에는 DataFrame에서도 호출가능합니다.**

**value_counts()를 사용할 때는 Null 값을 무시하고 결과값을 내놓기 쉽습니다. value_counts()는 Null값을 포함하여 개별데이터 값의 건수를 계산할지 여부를 dropna 인자로 판단합니다. dropna는 디폴트로 True이며 이 경우는 Null값을 무시하고 개별 데이터 값의 건수를 계산합니다**

In [15]:
# 값이 높은 순으로 내림차순으로 정렬합니다.
value_counts = titanic_df['Pclass'].value_counts()
value_counts

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [16]:
print('titanic_df 데이터 건수:', titanic_df.shape[0])
print("")
print('기본 설정인 dropna=True로 value_counts()')
# value_counts()는 디폴트로 dropna=True 이므로 value_counts(dropna=True)와 동일
print(titanic_df['Embarked'].value_counts())
print("")
print('dropna=False로 value_counts()')
print(titanic_df['Embarked'].value_counts(dropna=False))

titanic_df 데이터 건수: 891

기본 설정인 dropna=True로 value_counts()
S    644
C    168
Q     77
Name: Embarked, dtype: int64

dropna=False로 value_counts()
S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64

In [17]:
# 데이터프레임에도 value_counts()
# 인덱스 기준으로 정렬이 아니라 값 기준으로 내림차순 정렬
titanic_df[['Pclass', 'Embarked']].value_counts()

Pclass  Embarked
3       S           353
2       S           164
1       S           127
        C            85
3       Q            72
        C            66
2       C            17
        Q             3
1       Q             2
dtype: int64

 # sort_values()로 정렬

**by=정렬컬럼, ascending=True 또는 False로 오름차순/내림차순으로 정렬**

In [18]:
titanic_df.sort_values(by='Pclass', ascending=True)

display(titanic_df[['Name','Age']].sort_values(by='Age'))
display(titanic_df[['Name','Age','Pclass']].sort_values(by=['Pclass','Age']))

          Name   Age
803  Thomas...  0.42
755  Hamala...  0.67
644  Baclin...  0.75
469  Baclin...  0.75
78   Caldwe...  0.83
..         ...   ...
859  Razi, ...   NaN
863  Sage, ...   NaN
868  van Me...   NaN
878  Laleff...   NaN
888  Johnst...   NaN

[891 rows x 2 columns]

          Name    Age  Pclass
305  Alliso...   0.92       1
297  Alliso...   2.00       1
445  Dodge,...   4.00       1
802  Carter...  11.00       1
435  Carter...  14.00       1
..         ...    ...     ...
859  Razi, ...    NaN       3
863  Sage, ...    NaN       3
868  van Me...    NaN       3
878  Laleff...    NaN       3
888  Johnst...    NaN       3

[891 rows x 3 columns]

 # 데이터프레임과 리스트, 딕셔너리, ndarray 상호변환

In [19]:
col_name1=['col1']
list1 = [1, 2, 3]

## 리스트, ndarray에서 데이터프레임으로 변환

In [20]:
# np.array()로 리스트를 칼럼으로 만들어 줍니다.

array1 = np.array(list1)
print(type(array1))
array1

<class 'numpy.ndarray'>

array([1, 2, 3])

In [21]:
# pd.DataFrame()으로 리스트, ndarray를 칼럼으로 만들어줍니다. 
# columns에 들어가는 인자는 리스트 형태로 들어가야 한다.

print('array1 shape:', array1.shape,  end="\n")
print("")

df_list1 = pd.DataFrame(list1, columns=col_name1)
print('1차원 리스트로 만든 DataFrame:\n', df_list1)
print("")

df_array1 = pd.DataFrame(array1, columns=col_name1)
print('1차원 ndarray로 만든 DataFrame:\n', df_array1)

array1 shape: (3,)

1차원 리스트로 만든 DataFrame:
    col1
0     1
1     2
2     3

1차원 ndarray로 만든 DataFrame:
    col1
0     1
1     2
2     3

In [22]:
# 데이터프레임은 컬럼이 하나여도 2차원 형태다
# 시리즈는 1차원 형태다
print('df_list1과 df_array1은 2차원 형태이다')

print(df_list1.shape)
print(df_array1.shape)

df_list1과 df_array1은 2차원 형태이다
(3, 1)
(3, 1)

In [23]:
# 3개의 컬럼명이 필요함. 
col_name2=['col1', 'col2', 'col3']

# 2행x3열 형태의 리스트와 ndarray 생성 한 뒤 이를 DataFrame으로 변환. 
list2 = [[1, 2, 3],
         [11, 12, 13]]
array2 = np.array(list2)
print('array2 shape:', array2.shape )
df_list2 = pd.DataFrame(list2, columns=col_name2)
print('2차원 리스트로 만든 DataFrame:\n', df_list2)
df_array1 = pd.DataFrame(array2, columns=col_name2)
print('2차원 ndarray로 만든 DataFrame:\n', df_array1)

array2 shape: (2, 3)
2차원 리스트로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13
2차원 ndarray로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13

## pd.DataFrame()으로 dictionary에서 DataFrame으로 변환

In [24]:
# Key는 컬럼명으로 매핑, Value는 리스트 형(또는 ndarray)
dict = {'col1':[1, 11], 'col2':[2, 22], 'col3':[3, 33]}
df_dict = pd.DataFrame(dict)
print('딕셔너리로 만든 DataFrame:\n', df_dict)

딕셔너리로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    22    33

 ## .values로 DataFrame에서 ndarray로 변환

In [25]:
# .values를 이용해 DataFrame을 ndarray로 변환
array3 = df_dict.values
print('df_dict.values 타입:', type(array3), 
      'df_dict.values shape:', array3.shape)
print("")
print(array3)

df_dict.values 타입: <class 'numpy.ndarray'> df_dict.values shape: (2, 3)

[[ 1  2  3]
 [11 22 33]]

 ## .tolist()로 DataFrame임을 리스트로 변환

In [26]:
# tolist()를 이용해 DataFrame을 리스트로 변환
list3 = df_dict.values.tolist()
print('df_dict.values.tolist() 타입:', type(list3))
print(list3)

df_dict.values.tolist() 타입: <class 'list'>
[[1, 2, 3], [11, 22, 33]]

## to_dict()로 DataFrame을 dictionary로 변환

In [27]:
df_dict

   col1  col2  col3
0     1     2     3
1    11    22    33

In [28]:
# to_dict()을 이용해 DataFrame을 딕셔너리로 변환
dict3 = df_dict.to_dict()
print('\n df_dict.to_dict() 타입:', type(dict3))
print(dict3)

 df_dict.to_dict() 타입: <class 'dict'>
{'col1': {0: 1, 1: 11}, 'col2': {0: 2, 1: 22}, 'col3': {0: 3, 1: 33}}

In [29]:
# to_dict('list')로 해줘야 컬럼의 값들이 value에 리스트로 들어간다
dict3 = df_dict.to_dict('list')
print('\n df_dict.to_dict() 타입:', type(dict3))
print(dict3)

 df_dict.to_dict() 타입: <class 'dict'>
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

 # 데이터프레임의 컬럼 생성과 수정

**DataFrame의 컬럼 데이터 세트 생성과 수정은 [ ] 연산자를 이용해 쉽게 할 수 있습니다. 새로운 컬럼에 값을 할당하려면 DataFrame [ ] 내에 새로운 컬럼명을 입력하고 값을 할당해주기만 하면 됩니다.**

In [30]:
titanic_df.head(3)

   PassengerId  Survived  Pclass       Name     Sex  ...  Parch     Ticket     Fare Cabin  Embarked
0          1           0       3  Braund...    male  ...      0  A/5 21171   7.2500   NaN         S
1          2           1       1  Cuming...  female  ...      0   PC 17599  71.2833   C85         C
2          3           1       3  Heikki...  female  ...      0  STON/O...   7.9250   NaN         S

[3 rows x 12 columns]

In [31]:
# 'Age_0'이라는 칼럼을 추가하고 값을 0으로 채운다.
titanic_df['Age_0']=0
titanic_df.head(3)

   PassengerId  Survived  Pclass       Name     Sex  ...     Ticket     Fare  Cabin Embarked  Age_0
0          1           0       3  Braund...    male  ...  A/5 21171   7.2500    NaN        S      0
1          2           1       1  Cuming...  female  ...   PC 17599  71.2833    C85        C      0
2          3           1       3  Heikki...  female  ...  STON/O...   7.9250    NaN        S      0

[3 rows x 13 columns]

In [32]:
titanic_df['Age_by_10'] = titanic_df['Age']*10
titanic_df['Family_No'] = titanic_df['SibSp'] + titanic_df['Parch']+1
titanic_df.head(3)

   PassengerId  Survived  Pclass       Name     Sex  ...  Cabin  Embarked  Age_0 Age_by_10  Family_No
0          1           0       3  Braund...    male  ...    NaN         S      0     220.0          2
1          2           1       1  Cuming...  female  ...    C85         C      0     380.0          2
2          3           1       3  Heikki...  female  ...    NaN         S      0     260.0          1

[3 rows x 15 columns]

In [33]:
titanic_df['Age_by_10'] = titanic_df['Age_by_10'] + 100
titanic_df.head(3)

   PassengerId  Survived  Pclass       Name     Sex  ...  Cabin  Embarked  Age_0 Age_by_10  Family_No
0          1           0       3  Braund...    male  ...    NaN         S      0     320.0          2
1          2           1       1  Cuming...  female  ...    C85         C      0     480.0          2
2          3           1       3  Heikki...  female  ...    NaN         S      0     360.0          1

[3 rows x 15 columns]

 # 데이터프레임 삭제

In [34]:
titanic_df.head(3)

   PassengerId  Survived  Pclass       Name     Sex  ...  Cabin  Embarked  Age_0 Age_by_10  Family_No
0          1           0       3  Braund...    male  ...    NaN         S      0     320.0          2
1          2           1       1  Cuming...  female  ...    C85         C      0     480.0          2
2          3           1       3  Heikki...  female  ...    NaN         S      0     360.0          1

[3 rows x 15 columns]

In [35]:
# axis=0이 행 삭제, axis=1이 컬럼삭제이다. axis=0이 디폴트이다

titanic_drop_df = titanic_df.drop('Age_0', axis=1)
titanic_drop_df.head(3)

   PassengerId  Survived  Pclass       Name     Sex  ...     Fare  Cabin  Embarked Age_by_10  Family_No
0          1           0       3  Braund...    male  ...   7.2500    NaN         S     320.0          2
1          2           1       1  Cuming...  female  ...  71.2833    C85         C     480.0          2
2          3           1       3  Heikki...  female  ...   7.9250    NaN         S     360.0          1

[3 rows x 14 columns]

**drop( )메소드의 inplace인자의 기본값은 False 입니다. 
이 경우 원본은 바뀌지 않으며 반환값을 새로운 객체에 할당할 경우에 drop된 값이 새 객체에 들어가게 됩니다.**

In [36]:
# 원본인 titanic_df는 바뀌지 않았다.
titanic_df.head(3)

   PassengerId  Survived  Pclass       Name     Sex  ...  Cabin  Embarked  Age_0 Age_by_10  Family_No
0          1           0       3  Braund...    male  ...    NaN         S      0     320.0          2
1          2           1       1  Cuming...  female  ...    C85         C      0     480.0          2
2          3           1       3  Heikki...  female  ...    NaN         S      0     360.0          1

[3 rows x 15 columns]

**여러개의 컬럼들의 삭제는 drop의 인자로 삭제 컬럼들을 리스트로 입력합니다. 
inplace=True 일 경우 원본이 바뀌며 이 때 반환값은 None입니다.**

In [37]:
drop_result = titanic_df.drop(['Age_0', 'Age_by_10', 'Family_No'], axis=1, inplace=True)
print(' inplace=True 로 drop 후 반환된 값:',drop_result)

# 원본이 바뀌었다.
titanic_df.head(3)

 inplace=True 로 drop 후 반환된 값: None

   PassengerId  Survived  Pclass       Name     Sex  ...  Parch     Ticket     Fare Cabin  Embarked
0          1           0       3  Braund...    male  ...      0  A/5 21171   7.2500   NaN         S
1          2           1       1  Cuming...  female  ...      0   PC 17599  71.2833   C85         C
2          3           1       3  Heikki...  female  ...      0  STON/O...   7.9250   NaN         S

[3 rows x 12 columns]

In [38]:
# axis=0 일 경우 drop()은 row 방향으로 데이터를 삭제합니다. 

titanic_df = pd.read_csv('C:/Users/wkdgu/권철민 머신러닝/PerfectGuide-master/PerfectGuide-master/2장/titanic/train.csv')
pd.set_option('display.width', 1000)
pd.set_option('display.max_colwidth', 15)
print('#### before axis 0 drop ####')
print(titanic_df.head(6))

titanic_df.drop([0,1,2], axis=0, inplace=True)

print('#### after axis 0 drop ####')
print(titanic_df.head(3))

#### before axis 0 drop ####
   PassengerId  Survived  Pclass            Name     Sex  ...  Parch          Ticket     Fare Cabin  Embarked
0            1         0       3  Braund, Mr....    male  ...      0       A/5 21171   7.2500   NaN         S
1            2         1       1  Cumings, Mr...  female  ...      0        PC 17599  71.2833   C85         C
2            3         1       3  Heikkinen, ...  female  ...      0  STON/O2. 31...   7.9250   NaN         S
3            4         1       1  Futrelle, M...  female  ...      0          113803  53.1000  C123         S
4            5         0       3  Allen, Mr. ...    male  ...      0          373450   8.0500   NaN         S
5            6         0       3  Moran, Mr. ...    male  ...      0          330877   8.4583   NaN         Q

[6 rows x 12 columns]
#### after axis 0 drop ####
   PassengerId  Survived  Pclass            Name     Sex  ...  Parch  Ticket     Fare Cabin  Embarked
3            4         1       1  Futrelle, M...  female  ...      0  113803  53.1000  C123         S
4            5         0       3  Allen, Mr. ...    male  ...      0  373450   8.0500   NaN         S
5            6         0       3  Moran, Mr. ...    male  ...      0  330877   8.4583   NaN         Q

[3 rows x 12 columns]

 # index 객체

In [5]:
titanic_df = pd.read_csv("C:/Users/wkdgu/권철민 머신러닝/PerfectGuide-master/PerfectGuide-master/2장/titanic/train.csv")
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
# .Index로 인덱스객체 추출
indexes = titanic_df.index
print(indexes)
print("")

# 인덱스객체를 실제 값 arrray로 변환 
# .values를 통해 Numpy로 바꿔주면 1차원으로 바뀐다.
print('Index 객체 array값:\n',indexes.values)

Index는 1차원 데이터 입니다.

In [ ]:
print(type(indexes.values))
print("")
print(indexes.values.shape)
print(indexes[:5].values)
print(indexes.values[:5])
print(indexes[6])

[ ]를 이용하여 임의로 Index의 값을 변경할 수는 없습니다.

In [ ]:
# indexes[0] = 5

Series 객체는 Index 객체를 포함하지만 Series 객체에 연산 함수를 적용할 때 Index는 연산에서 제외됩니다. Index는 오직 식별용으로만 사용됩니다.

In [ ]:
# 컬럼이 2개인 것 같지만 왼쪽은 인덱스이다.
series_fair = titanic_df['Fare']
series_fair.head(5)

In [ ]:
print('Fair Series max 값:', series_fair.max())
print('Fair Series sum 값:', series_fair.sum())
print('sum() Fair Series:', sum(series_fair))
print('Fair Series + 3:\n',(series_fair + 3).head(3) )

 ## reset_index()는 기존 인덱스를 칼럼으로 만들고 인덱스를 새롭게 초기화해줍니다.

DataFrame 및 Series에 reset_index( ) 메서드를 수행하면 새롭게 인덱스를 연속 숫자 형으로 할당하며 기존 인덱스는 ‘index’라는 새로운 컬럼 명으로 추가합니다

In [40]:
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex  ...  Parch  Ticket     Fare Cabin  Embarked
3            4         1       1  Futrelle, M...  female  ...      0  113803  53.1000  C123         S
4            5         0       3  Allen, Mr. ...    male  ...      0  373450   8.0500   NaN         S
5            6         0       3  Moran, Mr. ...    male  ...      0  330877   8.4583   NaN         Q

[3 rows x 12 columns]

In [41]:
# inplace=False가 기본값이다.
# inplace=False면 원본이 안바뀌고 새롭게 바뀐 값을 반환합니다
# inplace=True면 원본이 바뀌고 반환값이 없습니다.

titanic_reset_df = titanic_df.reset_index(inplace=False)
titanic_reset_df.head(3)

   index  PassengerId  Survived  Pclass            Name  ... Parch  Ticket     Fare  Cabin Embarked
0      3            4         1       1  Futrelle, M...  ...     0  113803  53.1000   C123        S
1      4            5         0       3  Allen, Mr. ...  ...     0  373450   8.0500    NaN        S
2      5            6         0       3  Moran, Mr. ...  ...     0  330877   8.4583    NaN        Q

[3 rows x 13 columns]

In [42]:
# drop=False가 기본값이다.
# drop=False면 기존 인덱스를 칼럼으로 만듭니다.
# drop=True면 기존 인덱스를 칼럼으로 안만들고 드랍해버립니다.

titanic_reset_df = titanic_df.reset_index(drop=True, inplace=False)
titanic_reset_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex  ...  Parch  Ticket     Fare Cabin  Embarked
0            4         1       1  Futrelle, M...  female  ...      0  113803  53.1000  C123         S
1            5         0       3  Allen, Mr. ...    male  ...      0  373450   8.0500   NaN         S
2            6         0       3  Moran, Mr. ...    male  ...      0  330877   8.4583   NaN         Q

[3 rows x 12 columns]

In [43]:
print('### before reset_index ###')
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)
print("")
print('value_counts 객체 변수 타입:',type(value_counts), value_counts.shape)
print("\n")

new_value_counts = value_counts.reset_index(inplace=False)
print('### After reset_index ###')
print(new_value_counts)
print("")
print('new_value_counts 객체 변수 타입:',type(new_value_counts))

### before reset_index ###
3    489
1    215
2    184
Name: Pclass, dtype: int64

value_counts 객체 변수 타입: <class 'pandas.core.series.Series'> (3,)


### After reset_index ###
   index  Pclass
0      3     489
1      1     215
2      2     184

new_value_counts 객체 변수 타입: <class 'pandas.core.frame.DataFrame'>

 # rename()으로 컬럼명 바꾸기

**rename()은 인자로 columns를 dictionary 형태로 받으며 '기존 컬럼명':'신규 컬럼명' 형태로 변환**

In [44]:
new_value_counts_01 = titanic_df['Pclass'].value_counts().reset_index()
new_value_counts_01.rename(columns={'index':'Pclass', 'Pclass':'Pclass_count'})

   Pclass  Pclass_count
0       3           489
1       1           215
2       2           184

 # DataFrame 인덱싱 및 필터링

 ## DataFrame의 []연산자

넘파이에서 [ ] 연산자는 행의 위치, 열의 위치, 슬라이싱 범위 등을 지정해 데이터를 가져올 수 있었습니다.
하지만 DataFrame 바로 뒤에 있는 ‘[ ]’ 안에 들어갈 수 있는 것은 컬럼 명 문자(또는 컬럼 명의 리스트
객체), 또는 인덱스로 변환 가능한 표현식입니다.

In [45]:
# DataFrame []내에 한개의 컬럼만 입력하면 Series 반환
series=titanic_df['Name']
print(series.head(3))
print("")
print(type(series))
print("")
print(series.shape)

3    Futrelle, M...
4    Allen, Mr. ...
5    Moran, Mr. ...
Name: Name, dtype: object

<class 'pandas.core.series.Series'>

(888,)

In [46]:
#DataFrame에서 []내에 여러개의 컬럼을 리스트로 입력하면 그 컬럼들로 구성된 DataFrame 반환
filter_df = titanic_df[['Name', 'Age']]

display(filter_df.head(3))

print(type(filter_df), filter_df.shape)

             Name   Age
3  Futrelle, M...  35.0
4  Allen, Mr. ...  35.0
5  Moran, Mr. ...   NaN

<class 'pandas.core.frame.DataFrame'> (888, 2)

In [47]:
#DataFrame에서 []내에 한개의 컬럼을 리스트로 입력하면 한개의 컬럼으로 구성된 DataFrame 반환
one_col_df = titanic_df[['Name']]
display(one_col_df.head(3))
print(type(one_col_df), one_col_df.shape)

             Name
3  Futrelle, M...
4  Allen, Mr. ...
5  Moran, Mr. ...

<class 'pandas.core.frame.DataFrame'> (888, 1)

In [48]:
# print('[ ] 안에 숫자 index는 KeyError 오류 발생:\n', titanic_df[0])

앞에서 DataFrame의 [ ] 내에 숫자 값을 입력할 경우 오류가 발생한다고 했는데, Pandas의 Index 형태로 변환가능한    
표현식은 [ ] 내에 입력할 수 있습니다.  
가령 titanic_df의 처음 2개 데이터를 추출하고자  titanic_df [ 0:2 ] 와 같은 슬라이싱을 이용하였다면 정확히 원하는 결과를 반환해 줍니다.

In [49]:
 titanic_df[0:2]

   PassengerId  Survived  Pclass            Name     Sex  ...  Parch  Ticket   Fare Cabin  Embarked
3            4         1       1  Futrelle, M...  female  ...      0  113803  53.10  C123         S
4            5         0       3  Allen, Mr. ...    male  ...      0  373450   8.05   NaN         S

[2 rows x 12 columns]

[ ] 내에 조건식을 입력하여 불린 인덱싱을 수행할 수 있습니다(DataFrame 바로 뒤에 있는 []안에 들어갈 수 있는 것은 컬럼명과 불린인덱싱으로 범위를 좁혀서 코딩을 하는게 도움이 됩니다)

In [50]:
titanic_df[ titanic_df['Pclass'] == 3].head(3)

   PassengerId  Survived  Pclass            Name   Sex  ...  Parch  Ticket     Fare Cabin  Embarked
4            5         0       3  Allen, Mr. ...  male  ...      0  373450   8.0500   NaN         S
5            6         0       3  Moran, Mr. ...  male  ...      0  330877   8.4583   NaN         Q
7            8         0       3  Palsson, Ma...  male  ...      1  349909  21.0750   NaN         S

[3 rows x 12 columns]

 ## DataFrame의 iloc(위치기반)

In [51]:
data = {'Name': ['Chulmin', 'Eunkyung','Jinwoong','Soobeom'],
        'Year': [2011, 2016, 2015, 2015],
        'Gender': ['Male', 'Female', 'Male', 'Male']
       }
data_df = pd.DataFrame(data, index=['one','two','three','four'])
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [52]:
data_df.iloc[0, 0]

'Chulmin'

In [53]:
data_df.iloc[0:2, [0,1]]

         Name  Year
one   Chulmin  2011
two  Eunkyung  2016

In [54]:
data_df.iloc[0:2, 0:3]

         Name  Year  Gender
one   Chulmin  2011    Male
two  Eunkyung  2016  Female

In [55]:
# 모든 데이터
data_df.iloc[:]

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [56]:
# 모든 데이터
data_df.iloc[:, :]

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [57]:
# 맨 마지막 칼럼데이터
data_df.iloc[:, -1]

one        Male
two      Female
three      Male
four       Male
Name: Gender, dtype: object

In [58]:
# 맨 마지막 칼럼을 제외한 모든 데이터
data_df.iloc[:, :-1]

           Name  Year
one     Chulmin  2011
two    Eunkyung  2016
three  Jinwoong  2015
four    Soobeom  2015

In [59]:
# 아래 코드는 오류를 발생합니다. 
# data_df.iloc[0, 'Name']
# data_df.iloc['one', 0]

In [60]:
# iloc[]는 불린 인덱싱을 지원하지 않습니다.

 ## DataFrame의 loc(명칭기반)

In [61]:
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [62]:
data_df.loc['one', 'Name']

'Chulmin'

In [63]:
# 아래 코드는 오류를 발생합니다. 
# data_df_reset.loc[0, 'Name']

In [64]:
#loc와 iloc의 슬라이싱 차이점

print('위치기반 iloc slicing\n', data_df.iloc[0:1, 0],'\n')
print('명칭기반 loc slicing\n', data_df.loc['one':'two', 'Name'])

위치기반 iloc slicing
 one    Chulmin
Name: Name, dtype: object

명칭기반 loc slicing
 one     Chulmin
two    Eunkyung
Name: Name, dtype: object

In [65]:
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [66]:
# loc는 불린 인덱싱을 지원합니다.

print('인덱스 값 three인 행의 Name칼럼값:', data_df.loc['three', 'Name'])
print('\n인덱스 값 one부터 two까지 행의 Name과 Year 칼럼값:\n', data_df.loc['one':'two', ['Name', 'Year']])
print('\n인덱스 값 one부터 three까지 행의 Name부터 Gender까지의 칼럼값:\n', data_df.loc['one':'three', 'Name':'Gender'])
print('\n모든 데이터 값:\n', data_df.loc[:])
print('\n불린 인덱싱:\n', data_df.loc[data_df.Year >= 2014])

인덱스 값 three인 행의 Name칼럼값: Jinwoong

인덱스 값 one부터 two까지 행의 Name과 Year 칼럼값:
          Name  Year
one   Chulmin  2011
two  Eunkyung  2016

인덱스 값 one부터 three까지 행의 Name부터 Gender까지의 칼럼값:
            Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male

모든 데이터 값:
            Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

불린 인덱싱:
            Name  Year  Gender
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

 ## 불린 인덱싱

** 불린 인덱싱(Boolean indexing) **  
헷갈리는 위치기반, 명칭기반 인덱싱을 사용할 필요없이 조건식을 [ ] 안에 기입하여 간편하게 필터링을 수행.

In [67]:
pd.set_option('max_columns', 20)
titanic_boolean = titanic_df[titanic_df['Age'] > 60]
print(type(titanic_boolean))
titanic_boolean

<class 'pandas.core.frame.DataFrame'>

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch      Ticket     Fare Cabin Embarked
33            34         0       2  Wheadon, Mr...    male  66.0      0      0  C.A. 24579  10.5000   NaN        S
54            55         0       1  Ostby, Mr. ...    male  65.0      0      1      113509  61.9792   B30        C
96            97         0       1  Goldschmidt...    male  71.0      0      0    PC 17754  34.6542    A5        C
116          117         0       3  Connors, Mr...    male  70.5      0      0      370369   7.7500   NaN        Q
170          171         0       1  Van der hoe...    male  61.0      0      0      111240  33.5000   B19        S
..           ...       ...     ...             ...     ...   ...    ...    ...         ...      ...   ...      ...
630          631         1       1  Barkworth, ...    male  80.0      0      0       27042  30.0000   A23        S
672          673         0       2  Mitchell, M...    male  70.0      0      0  C.A. 24580  10.5000   NaN        S
745          746         0       1  Crosby, Cap...    male  70.0      1      1   WE/P 5735  71.0000   B22        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0      113572  80.0000   B28      NaN
851          852         0       3  Svensson, M...    male  74.0      0      0      347060   7.7750   NaN        S

[22 rows x 12 columns]

In [68]:
# titanic_df의 'Age' 칼럼에서 나이가 60이상인 행중에서 'Name','Age' 칼럼만 표시
titanic_df[titanic_df['Age'] > 60][['Name','Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [69]:
# 순서가 바뀌어도 상관없음
titanic_df[['Name','Age']][titanic_df['Age'] > 60].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [70]:
#loc[]도 boolean 인덱싱이 가능
titanic_df.loc[titanic_df['Age'] > 60, ['Name','Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

논리 연산자로 결합된 조건식도 불린 인덱싱으로 적용 가능합니다.

In [71]:
# and는 &, or은 | 입니다

In [72]:
titanic_df[ (titanic_df['Age'] > 60) & (titanic_df['Pclass']==1) & (titanic_df['Sex']=='female')]

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN

조건식은 변수로도 할당 가능합니다. 복잡한 조건식은 변수로 할당하여 가득성을 향상 할 수 있습니다.

In [73]:
cond1 = titanic_df['Age'] > 60
cond2 = titanic_df['Pclass']==1
cond3 = titanic_df['Sex']=='female'
titanic_df[ cond1 & cond2 & cond3]

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN

 # Aggregation 함수 및 Gruopby 적용

* DataFrame은 Group by 연산을 위해 groupby() 메서드를 제공
* groupby() 메소드는 by 인자로 group by하려는 컬럼명을 입력 받으면 DataFrameGroupBy 객체를 반환
* 이렇게 반환된 DataFrameGroupBy 객체에 aggregation 함수를 수행

In [74]:
titanic_df.head(5)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q
6            7         0       1  McCarthy, M...    male  54.0      0      0   17463  51.8625   E46        S
7            8         0       3  Palsson, Ma...    male   2.0      3      1  349909  21.0750   NaN        S

In [75]:
# NaN 값은 count에서 제외
titanic_df.count()

PassengerId    888
Survived       888
Pclass         888
Name           888
Sex            888
              ...
Parch          888
Ticket         888
Fare           888
Cabin          203
Embarked       886
Length: 12, dtype: int64

특정 컬럼들로 Aggregation 함수 수행

In [76]:
titanic_df[['Age', 'Fare']].mean()

Age     29.703474
Fare    32.215643
dtype: float64

In [77]:
titanic_df[['Age', 'Fare']].sum()

Age     21119.170
Fare    28607.491
dtype: float64

In [78]:
titanic_df[['Age', 'Fare']].count()

Age     711
Fare    888
dtype: int64

**groupby( )**
* by 인자에 Group By 하고자 하는 컬럼을 입력
* 여러개의 컬럼으로 Group by 하고자 하면 [ ] 내에 해당 컬럼명을 입력. 
* DataFrame에 groupby( )를 호출하면 DataFrameGroupBy 객체를 반환.

In [79]:
titanic_groupby = titanic_df.groupby(by='Pclass')
print(type(titanic_groupby))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [80]:
# titanic_groupby는 titanic_df를 'Pclass'로 groupby한 groupby 객체이다. 
# groupby객체는 데이터프레임의 모든 컬럼들을 가지고 있다.
titanic_groupby[['Age', 'Fare']]

In [81]:
# groupby객체에 aggregation 함수를 적용해줘야 DataFrame 형태로 풀린다.
titanic_groupby[['Age', 'Fare']].count()

        Age  Fare
Pclass
1       185   215
2       173   184
3       353   489

In [82]:
# Pclass는 인덱스이다

titanic_groupby = titanic_df.groupby('Pclass').count()
titanic_groupby

        PassengerId  Survived  Name  Sex  Age  SibSp  Parch  Ticket  Fare  Cabin  Embarked
Pclass
1               215       215   215  215  185    215    215     215   215    175       213
2               184       184   184  184  173    184    184     184   184     16       184
3               489       489   489  489  353    489    489     489   489     12       489

In [83]:
print(type(titanic_groupby))
print(titanic_groupby.shape)
print(titanic_groupby.index)

<class 'pandas.core.frame.DataFrame'>
(3, 11)
Int64Index([1, 2, 3], dtype='int64', name='Pclass')

In [84]:
titanic_groupby = titanic_df.groupby(by='Pclass')[['PassengerId', 'Survived']].count()
titanic_groupby

        PassengerId  Survived
Pclass
1               215       215
2               184       184
3               489       489

In [85]:
titanic_df[['Pclass','PassengerId', 'Survived']].groupby('Pclass').count()

        PassengerId  Survived
Pclass
1               215       215
2               184       184
3               489       489

In [86]:
titanic_df.groupby('Pclass')['Pclass'].count()

Pclass
1    215
2    184
3    489
Name: Pclass, dtype: int64

In [87]:
titanic_df['Pclass'].value_counts().sort_index()

1    215
2    184
3    489
Name: Pclass, dtype: int64

판다스는 여러개의 aggregation 함수를 적용할 수 있도록 agg( )함수를 별도로 제공

In [88]:
titanic_df.groupby('Pclass')['Age'].agg([max, min])

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

**서로 다른 컬럼에 서로 다른 aggrgation 메소드를 적용할 경우 agg()내에 컬럼과 적용할 메소드를 Dict 형태로 입력**

In [89]:
# 딕셔너리 형태로 들어갈 경우 리스트와 다르게 콤마를 붙여줘야 됨 
agg_format={'Age':'max', 'SibSp':'sum', 'Fare':'mean'}
titanic_df.groupby('Pclass').agg(agg_format)

         Age  SibSp       Fare
Pclass
1       80.0     89  84.214554
2       70.0     74  20.662183
3       74.0    301  13.700450

 # Named Aggregation

**agg내의 인자로 들어가는 Dict객체에 동일한 key값을 가지는 두개의 value가 있을 경우 마지막 value로 update됨**
* 즉 동일 컬럼에 서로 다른 aggregation을 가지면서 추가적인 컬럼 aggregation이 있을 경우 원하는 결과로 출력되지 않음

In [104]:
agg_format = {'Age' : 'max', 'Age' : 'mean', 'Fare' : 'mean'}
titanic_df.groupby('Pclass').agg(agg_format)

              Age       Fare
Pclass
1       37.044299  84.214554
2       29.867219  20.662183
3       26.414300  13.700450

In [107]:
titanic_df.groupby(['Pclass']).agg(age_max = ('Age', 'max'), age_mean = ('Age', 'mean'), fare_mean = ('Fare', 'mean'))

        age_max   age_mean  fare_mean
Pclass
1          80.0  37.044299  84.214554
2          70.0  29.867219  20.662183
3          74.0  26.414300  13.700450

In [109]:
titanic_df.groupby('Pclass').agg(
age_max = pd.NamedAgg(column = 'Age', aggfunc = 'max'),
age_mean = pd.NamedAgg(column = 'Age', aggfunc = 'mean'),
fare_mean = pd.NamedAgg(column = 'Fare', aggfunc = 'mean'))

        age_max   age_mean  fare_mean
Pclass
1          80.0  37.044299  84.214554
2          70.0  29.867219  20.662183
3          74.0  26.414300  13.700450

 # Missing 데이터 처리하기

 ## isna()

DataFrame의 isna( ) 메소드는 모든 컬럼값들이 NaN인지 True/False값을 반환합니다(NaN이면 True)

In [92]:
titanic_df.isna().head(3)

   PassengerId  Survived  Pclass   Name    Sex    Age  SibSp  Parch  Ticket   Fare  Cabin  Embarked
3        False     False   False  False  False  False  False  False   False  False  False     False
4        False     False   False  False  False  False  False  False   False  False   True     False
5        False     False   False  False  False   True  False  False   False  False   True     False

아래와 같이 isna( ) 반환 결과에 sum( )을 호출하여 컬럼별로 NaN 건수를 구할 수 있습니다.

In [93]:
titanic_df.isna( ).sum( )

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
              ...
Parch            0
Ticket           0
Fare             0
Cabin          685
Embarked         2
Length: 12, dtype: int64

 ## fillna()

In [94]:
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000')
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500  C000        S
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583  C000        Q

In [95]:
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')
titanic_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
              ..
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
Length: 12, dtype: int64

 # nunique로 컬럼내 몇건의 고유값이 있는지 파악

In [110]:
titanic_df['Name'].value_counts()

Futrelle, Mrs. Jacques Heath (Lily May Peel)    1
Duff Gordon, Sir. Cosmo Edmund ("Mr Morgan")    1
Gilinski, Mr. Eliezer                           1
Murdlin, Mr. Joseph                             1
Rintamaki, Mr. Matti                            1
                                               ..
Johnson, Mr. William Cahoone Jr                 1
Keane, Miss. Nora A                             1
Williams, Mr. Howard Hugh "Harry"               1
Allison, Master. Hudson Trevor                  1
Dooley, Mr. Patrick                             1
Name: Name, Length: 888, dtype: int64

In [111]:
titanic_df['Name'].nunique()

888

In [112]:
titanic_df['Pclass'].value_counts()

3    489
1    215
2    184
Name: Pclass, dtype: int64

In [113]:
titanic_df['Pclass'].nunique()

3

 # replace로 원본 값을 특정 값으로 대체

In [115]:
replace_test_df = pd.read_csv("C:/Users/wkdgu/권철민 머신러닝/PerfectGuide-master/PerfectGuide-master/2장/titanic/train.csv")
replace_test_df.head()

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S
3            4         1       1  Futrelle, M...  female  35.0      1      0          113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0          373450   8.0500   NaN        S

In [117]:
# Sex의 "male"을 "man"으로 대체한 객체를 반환
replace_test_df['Sex'].replace('male', 'man')

0         man
1      female
2      female
3      female
4         man
        ...
886       man
887    female
888    female
889       man
890       man
Name: Sex, Length: 891, dtype: object

In [120]:
# 원본 Sex의 male과 female을 man과 woman으로 변경
replace_test_df['Sex'].replace({'male' : 'Man', 'female' : 'Woman'}, inplace = True)
replace_test_df

     PassengerId  Survived  Pclass            Name    Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0              1         0       3  Braund, Mr....    Man  22.0      1      0       A/5 21171   7.2500   NaN        S
1              2         1       1  Cumings, Mr...  Woman  38.0      1      0        PC 17599  71.2833   C85        C
2              3         1       3  Heikkinen, ...  Woman  26.0      0      0  STON/O2. 31...   7.9250   NaN        S
3              4         1       1  Futrelle, M...  Woman  35.0      1      0          113803  53.1000  C123        S
4              5         0       3  Allen, Mr. ...    Man  35.0      0      0          373450   8.0500   NaN        S
..           ...       ...     ...             ...    ...   ...    ...    ...             ...      ...   ...      ...
886          887         0       2  Montvila, R...    Man  27.0      0      0          211536  13.0000   NaN        S
887          888         1       1  Graham, Mis...  Woman  19.0      0      0          112053  30.0000   B42        S
888          889         0       3  Johnston, M...  Woman   NaN      1      2      W./C. 6607  23.4500   NaN        S
889          890         1       1  Behr, Mr. K...    Man  26.0      0      0          111369  30.0000  C148        C
890          891         0       3  Dooley, Mr....    Man  32.0      0      0          370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [121]:
# Cabin칼럼의 결측치를 C001로 채워줌
replace_test_df['Cabin'] = replace_test_df['Cabin'].replace(np.nan, 'C001')

 # lambda

In [96]:
def get_square(a):
    return a**2

print('3의 제곱은:',get_square(3))

3의 제곱은: 9

In [97]:
# lamda 입력값 : 출렵값
lambda_square = lambda x : x ** 2
print('3의 제곱은:',lambda_square(3))

3의 제곱은: 9

In [98]:
a=[1,2,3]
squares = map(lambda x : x**2, a)
list(squares)

[1, 4, 9]

 판다스에 lambda 식 적용

In [99]:
titanic_df['Name_len']= titanic_df['Name'].apply(lambda x : len(x))
titanic_df[['Name','Name_len']].head(3)

             Name  Name_len
3  Futrelle, M...        44
4  Allen, Mr. ...        24
5  Moran, Mr. ...        16

In [100]:
titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x : 'Child' if x <=15 else 'Adult' )
titanic_df[['Age','Child_Adult']].head(10)

          Age Child_Adult
3   35.000000       Adult
4   35.000000       Adult
5   29.703474       Adult
6   54.000000       Adult
7    2.000000       Child
8   27.000000       Adult
9   14.000000       Child
10   4.000000       Child
11  58.000000       Adult
12  20.000000       Adult

In [101]:
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : 'Child' if x<=15 else ('Adult' if x <= 60 else 
                                                                                  'Elderly'))
titanic_df['Age_cat'].value_counts()

Adult      783
Child       83
Elderly     22
Name: Age_cat, dtype: int64

In [102]:
def get_category(age):
    cat = ''
    if age <= 5: cat = 'Baby'
    elif age <= 12: cat = 'Child'
    elif age <= 18: cat = 'Teenager'
    elif age <= 25: cat = 'Student'
    elif age <= 35: cat = 'Young Adult'
    elif age <= 60: cat = 'Adult'
    else : cat = 'Elderly'
    
    return cat

titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : get_category(x))
titanic_df[['Age','Age_cat']].head()

         Age      Age_cat
3  35.000000  Young Adult
4  35.000000  Young Adult
5  29.703474  Young Adult
6  54.000000        Adult
7   2.000000         Baby